<template>
	<div class="about">
		<div class="container about__container">
			<!-- Content -->
			<main class="about__content">
				<article class="about__article">
					<!-- Header -->
					<header class="about__header">
						<h1 class="about__title">О компании</h1>
					</header>
					<!-- Body -->
					<section class="about__body">
						<p>Основной вектор развития нашей Компании – продукция из древесины.</p>
						<p>Мы поставили себе амбициозную задачу – укрепить позиции на растущем рынке, что невозможно без предоставления нашим клиентам инновационной, качественной продукции, обеспечения стабильных поставок и интересных решений, учитывающих все пожелания клиента.</p>
						<p>Ни для кого не секрет,&nbsp;что самый&nbsp;лучший лес произрастает в северных регионах России. К ним относится и Вологодская область. Благодаря умеренной заболоченности древесина наших лесов имеет:</p>
						<ul>
							<li>богатую текстуру и&nbsp;более гладкую обработку</li>
							<li>низкую усушку и&nbsp;геометрические колебания размеров</li>
							<li>высокую сопротивляемость гниению</li>
							<li>больший срок службы</li>
							<li>100% экологически чистый лес</li>
						</ul>

						<p>Благодаря этому мы гарантируем не только качество, но и долговечность бани. За период существования нами изготовлено свыше 2000 тысяч бань.</p>
						<lazy-hydrate when-visible>
							<slider
								:items="[{
									filename: 'exhibition-1.jpg'
								},{
									filename: 'exhibition-2.jpg'
								}]"
								gallery-style="medium"
								width="398px"
								height="251px"
								:per-page="[
									[0, 1],
									[375, 1],
									[480, 2],
									[768, 2],
									[992, 2]
								]"
							/>
						</lazy-hydrate>
						<small>
							<em>Постоянно действующая выставка малоэтажного домостроения «Вологодская слобода»</em>
						</small>
						<h2>История развития</h2>
						<p>В 2016 году в собственности компании появляются первые производственные помещения. Выбору оборудования было уделено особое внимание, мы остановились на известных мировых брендах, таких как «Weinig» и «Muhlbock».</p>
						<p><b>«Weinig»</b> – является гарантией высокого качества во&nbsp;всем мире. Уже 60 лет эта компания известна в&nbsp;России. Продукция «Weinig»&nbsp;− это оборудование, на&nbsp;котором самые успешные деревообрабатывающие предприятия изготавливают паркет, двери, брус для домостроения, мебельный щит и&nbsp;любые изделия, требующие обработки массивной древесины.</p>
						<p><b>«Muhlbock»</b> – известная австрийская компания, производящая высококачественное и высокотехнологичное сушильное оборудование для всех видов пород древесины. Бренд известен как надежный производитель, владеющий передовыми технологиями, и гарантирующий, высокое качество и эффективность работы своих сушилок. Поэтому сушильные камеры «Muhlbock» по праву являются лидирующими на российском рынке. Камеры выполняют сушку древесины посредством интенсивного воздушного теплообмена, что гарантирует эффективное выведение влаги с минимальными отклонениями по геометрии в материале.</p>
						<p>Наша компания имеет большой многогранный опыт в изготовлении бань, полученный годами. Поэтому к выбору кадрового состава, руководство подходит очень основательно и учитывает все необходимые требования.</p>
						<p>Преследуя цель выхода на рынки России, Европы и СНГ, был разработан пилотный проект и принято решение о запуске собственного производства в сегменте мобильных, перевозных бань-бочек. Используя имеющийся опыт и знания, учитывая собственные ошибки, с производством каждой бани, мы не только улучшали, но и модернизировали свой продукт, подводя многие циклы сборки под конвейерное&nbsp;производство.</p>
						<h3>Наше производство</h3>
						<lazy-hydrate when-visible>
							<slider
								:items="manufacture"
								gallery-style="medium"
								width="auto"
								height="160px"
								:per-page="[
									[0, 1],
									[375, 2],
									[480, 3],
									[768, 4],
									[992, 5]
								]"

							/>
						</lazy-hydrate>
						<p>Благодаря контактам, полученным за годы работы, в 2017 году был заключен Контракт с одной из крупнейших домостроительных компаний России на годовое изготовление и поставку нашей продукции в несколько регионов страны.</p>
						<p>В октябре 2018 года Контракт был продлен до 2021 года. Мы ценим оказанное нам доверие и очень гордимся этим событием! Это послужило сильнейшим импульсом в развитии нашей Компании.</p>
						<p>В начале пути Компания была зарегистрирована Индивидуальным предпринимателем (ИП). В угоду имиджа, узнаваемости бренда и целях маркетинга в 2017 году ИП было ликвидировано и регистрировано ООО «Бани Бочки Онлайн». </p>
						<p>С этого момента мы начинаем активно заниматься рекламой и маркетингом. Создаем площадки на просторах интернета, страницы в социальных сетях, YouTube канале и т.п. С каждым днем мы получаем все больше одобрительных отзывов клиентов, подписчиков и друзей, дополняем контент нужной и полезной информацией, регулярно выкладываем фото наших работ. За счет отличительных черт внешнего и внутреннего дизайна продукцию ООО «Бани Бочки Онлайн» узнают во многих уголках России.</p>
						<p>За годы работы был создан собственный автопарк, в состав которого входят: манипуляторы «Hyundai&nbsp;HD-78», Газели «Фермер» длинной 4 и 6 метров. Именно это позволило существенно сократить стоимость поставки продукции в регионы. Одним пунктом стратегического плана ООО «Бани Бочки Онлайн» является расширение автопарка. В ближайший период времени планируется приобретение большегруза немецкого концерна «Man».</p>
						<p>Стремясь завоевать доверие и сердца наших покупателей, доказать отменное качество нашей продукции с сентября 2019 года логотип ООО «Бани Бочки Онлайн» является регистрированным товарным знаком. И каждый сотрудник Компании четко понимает, что это накладывает на него еще больше ответственности! На кону стоит репутация, приобретенная годами!</p>
						<p>Благодаря комплексу работ, а именно: предпринятых усилий; собственному производству на каждом этапе; надежным и верным поставщикам пиломатериала, комплектующего оборудования и прочих деталей, поставляемых нашими партнерами напрямую; объему продаж; дружному и ответственному коллективу нашей Компании при работе с нами Вы получаете:</p>
						<ul>
							<li>высокое качество материалов сборки</li>
							<li>контроль сборки на всех этапах</li>
							<li>полную и подробную консультацию. Наши сотрудники свободно ориентируются во всех тонкостях производства и готовы ответить на любой интересующий Вас вопрос</li>
							<li>по запросу клиента мы готовы предоставить подробный фотоотчет на любом этапе изготовления заказа</li>
							<li>полную комплектацию «под ключ»</li>
							<li>адекватные цены</li>
							<li>открытость и легкость в общении</li>
						</ul>
						<h3>Ценности ООО «Бани Бочки Онлайн»:</h3>
						<ul>
							<li>работать профессионально, оперативно и качественно</li>
							<li>использовать индивидуальный подход и ориентироваться на максимальное</li>
							<li>удовлетворять потребности и пожелания клиентов</li>
							<li>дорожить своими партнерами и делать все возможное для эффективного сотрудничества</li>
							<li>быть всегда открытыми к работе с новыми клиентами и партнерами</li>
							<li>уважительно относиться к своим конкурентам</li>
							<li>не останавливаться на достигнутом и постоянно развиваться</li>
						</ul>
						<p>Выбирая любой товар, мы всегда ориентируемся на цену. Причем считается, что высокая цена автоматически равна высокому качеству и наоборот. Приобретая продукцию ООО «Бани Бочки Онлайн» мы докажем Вам, что это не так.</p>
						<p>Главная цель – это качество, долговечность и доступность наших изделий!</p>
						<h4>Работаем по всей России, главный офис, <br> постоянная выставка находятся в Вологде.</h4>
						<div class="contacts">
							<p>Россия, Вологодская область, г. Вологда, ул. Вологодская Слобода.<br> Режим работы: с 9:00 до 17:00. Без выходных.<br>Генеральный директор: Волков Александр Игоревич.</p>
							<p>Отдел продаж: <b><a target="_blank" href="tel:88002224261">8 800 222 42 61</a></b> звонок бесплатный из любой точки России</p>
							<p>Письменные вопросы можно направлять по е-mail:</p>
							<ul>
								<li><a href="mailto:region35les@mail.ru?subject=Новый вопрос">region35les@mail.ru</a></li>
								<li>или ВКонтакте <a rel="nofollow" href="https://vk.com/banybochkionline" target="_blank">https://vk.com/banybochkionline</a></li>
							</ul>
						</div>
					</section>
				</article>
			</main>
			<!-- Aside -->
			<aside class="about__aside">
				<h2 class="about__aside-title">Сертификаты и благодарственные письма</h2>
				<ul class="certificates">
					<li
						v-for="(item, index) in lightbox"
						:key="index"
						class="certificates__item"
					>
						<nuxt-img
							class="certificates__img"
							:src="item.href"
							:alt="`Сертификат ${index + 1}`"
							width="397px"
							height="561px"
							decoding="async"
							loading="lazy"
							@click="handleCertificateClick(index)"
							format="webp"
						/>
					</li>
				</ul>
			</aside>
		</div>
	</div>
</template>
<script>

import { mapGetters } from 'vuex'

import LazyHydrate from 'vue-lazy-hydration'
import Slider from '~/components/Slider'

export default {
	components: {
		LazyHydrate,
		Slider
	},

	layout: 'default',

	middleware: [],

	head() {
		return {
			title: `О компании Бани Бочки Онлайн`,
			titleTemplate: '%s',
			meta: [
				{
					hid : 'description',
					name: 'description',
					content: `История развития компании, фото с производства, благодарственные письма и сертификаты`
				},
				{
					hid : 'keywords',
					name: 'keywords',
					content: `о компании, бани бочки`
				},
				{
					name: 'og:title',
					content: `О компании Бани Бочки Онлайн`
				},
			],
			link: [
				{ rel: 'canonical', href: `${process.env.frontUrl}${this.$route.path}` }
			]
		}
	},

	props: {},

	computed: {
		...mapGetters({}),
		breadcrumbs() {
			return [
				{
					title: 'О компании',
					url: '/about',
				},
			]
		},
		mediaUrl() {
			return this.$config.urls.back
		},
		lightbox() {
			return this.certificates.map(item => {
				return {
					href: `${this.mediaUrl}/images/${item.filename}`
				}
			})
		}
	},

	mounted() {
		this.gallery = this.$glightbox({
			elements: this.lightbox,
			autoplayVideos: true,
		})
	},

	watch: {
		breadcrumbs: {
			immediate: true,
			handler(val) {
				this.$store.commit('breadcrumbs/SET_BREADCRUMBS', val)
			}
		}
	},

	data: () => ({
		gallery: null,
		certificates: [
			{
				filename: 'certificate-5.jpg'
			},
			{
				filename: 'certificate-new.jpg'
			},
			{
				filename: 'certificate-2.jpg'
			},
			{
				filename: 'certificate-3.jpg'
			},
			{
				filename: 'note-1.jpg'
			},
			{
				filename: 'note-2.jpg'
			},
		],
		manufacture: [
			{
				filename: 'manufacture-1.jpg',
			},
			{
				filename: 'manufacture-2.jpg',
			},
			{
				filename: 'manufacture-3.jpg',
			},
			{
				filename: 'manufacture-4.jpg',
			},
			{
				filename: 'manufacture-5.jpg',
			},
			{
				filename: 'manufacture-6.jpg',
			},
			{
				filename: 'manufacture-7.jpg',
			},
			{
				filename: 'manufacture-8.jpg',
			},
			{
				filename: 'manufacture-9.jpg',
			},
			{
				filename: 'manufacture-10.jpg',
			},
			{
				filename: 'manufacture-11.jpg',
			},
		]
	}),

	methods: {
		handleContactsClick() {
			this.$store.dispatch('modal/setContacts', true)
		},
		handleCertificateClick(index) {
			this.gallery.openAt(index)
		}
	},
}
</script>
<style lang="scss">
	.about {
		&__container {
			grid-column-gap: 28px;
			display: grid;
			grid-template-areas: 'content aside';
			grid-template-columns: minmax(0, 8fr) 4fr;
			@include mq('laptop') {
				grid-template-areas:
					'content'
					'aside';
				grid-template-columns: repeat(1, 1fr);
			}
		}
		&__content {
			grid-area: content;
		}
		&__title {
			margin: 0 0 30px 0;
			font-weight: 700;
			font-size: 32px;
			line-height: 32px;
			@include mq('tablet') {
				margin: 30px 0;
			}
		}
		&__aside {
			grid-area: aside;
			@include mq('mobile') {
				margin-bottom: 30px;
			}
			&-title {
				margin: 0 0 30px;
				line-height: 32px;
			}
		}
		.certificates {
			margin: 0;
			padding: 0;
			list-style: none;
			@include mq('laptop') {
				display: grid;
				grid-template-columns: repeat(4, 1fr);
				grid-column-gap: 28px;
			}
			@include mq('tablet') {
				grid-column-gap: 15px;
				grid-row-gap: 15px;
			}
			@include mq('mobile') {
				grid-template-columns: repeat(2, 1fr);
			}
			&__item {
				margin-bottom: 30px;
				cursor: pointer;
				@include mq('mobile') {
					margin-bottom: 0;
				}
			}
			&__img {
				width: 100%;
				height: auto;
			}
		}
	}
</style>